app/Http/Controllers/ImagesManagementSubsystemController.php

insert into `images` (`title`, `description`, `rating`, `price`, `is_visible`, `fk_collection_id_dabartine`, `fk_collection_id_originali`, `fk_user_id_savininkas`, `fk_user_id_kurejas`, `image`, `updated_at`, `created_at`) values ('asdf', 'dfghfgh', 0, '99.57', 1, '1', '1', 1, 1, 'storage/images/TAKaIYNby41f27riWdevXIwFtoh6RcoXtlLB1VWd.jpg', '2022-05-06 13:52:23', '2022-05-06 13:52:23')
---
    public function submitNewImageCreation(Request $request)
    {
        $this->validateNewImageData($request);

        // save the image file in storage/public/images
        $path = $request->file('image')->store('public/images');
        $path_arr = explode("/", $path);

        // create new image entry in the database
        $img = new image;

        $img->title = $request->title;
        $img->description = $request->description;
        $img->rating = 0;
        $img->price = $request->price;
        $img->is_visible = true;
        $img->fk_collection_id_dabartine = $request->collection_id;
        $img->fk_collection_id_originali = $request->collection_id;
        $img->fk_user_id_savininkas = $this->USER_ID;
        $img->fk_user_id_kurejas = $this->USER_ID;

        // create file path in format: "storage/images/{filename}"
        $img->image = 'storage/'.$path_arr[1].'/'.$path_arr[2];

        $img->save();

select * from `images` where `images`.`id` = '1' limit 1
---
    public function deleteImage($id) {
        # get image for sale
        $image_for_sale = image_for_sale::where('id', $id)->get();

        # delete comments
        comment::where('fk_image_for_sale_id', $image_for_sale[0]->id)->delete();

        # delete image bills
        bill::where('fk_image_id', $id)->delete();

        # delete image ratings
        image_rating::where('fk_image_id', $id)->delete();

        # get image
        $img = image::findOrFail($image_for_sale[0]->fk_image_id);

select * from `images` where `id` = '1' limit 1
---
    public function editImageInformation($id) {
        $img = image::findOrFail($id);
        return view('ImageInformationEditView')->with('image', $img);

select * from `images` where `id` = '1' limit 1
---
    public function openOwnedImageInformationView($id)
    {
        $image = DB::table('images')->find($id);   //vienam