app/Http/Controllers/testRolkaController.php

    public function openCreatedCollectionsListView($id)
    {
        $collections = DB::table('collections')
        ->where('fk_user_id_kurejas', $id)
        ->get();
---
select * from `collections` where `fk_user_id_kurejas` = '1'

    public function openCollectionCreationView($id)
    {
         $collections = DB::table('collections')
            ->where('id', $id)
            ->get();
---
select * from `collections` where `id` = 'new'

    public function deleteCollection($userId, $collectionId)
    {
        DB::delete('DELETE FROM collections
                    WHERE id = ?', [$collectionId]);
        $collections = DB::table('collections')
            ->where('fk_user_id_kurejas', $userId)
            ->get();
---
select * from `collections` where `fk_user_id_kurejas` = '1'

    public function createCollection(Request $request, $userId)
    {
        //Debugbar::addMessage($request->input('collectionName'));
        DB::insert('INSERT INTO collections (name, description, fk_user_id_kurejas)
                    VALUES(?, ?, ?)', [
                $request->input('collectionName'),
                $request->input('description'),
                $userId
            ]);
        $request->request->remove('collectionName');    //neremovina laiku...
        $request->request->remove('description');
        $collections = DB::table('collections')
        ->where('fk_user_id_kurejas', $userId)
        ->get();
---
select * from `collections` where `fk_user_id_kurejas` = '1'

    public function openEditCollectionView($userId, $collectionId, $collectionName, $collectionDescription)
    {
        //Debugbar::addMessage($request->input('collectionName'));

        $collections = DB::table('collections')
        ->where('fk_user_id_kurejas', $userId)
        ->get();
---
select * from `collections` where `fk_user_id_kurejas` = '1'

    public function editCollection(Request $request, $userId, $collectionId)
    {

        Debugbar::addMessage($userId);
        Debugbar::addMessage($collectionId);
        Debugbar::addMessage($request->input('collectionName'));
        Debugbar::addMessage($request->input('description'));

        DB::update('UPDATE collections SET name = ?, description = ? WHERE id = ?',[
                     $request->input('collectionName'),
                     $request->input('description'),
                     $collectionId
                    ]);
        $collections = DB::table('collections')
        ->where('fk_user_id_kurejas', $userId)
        ->get();
---
select * from `collections` where `fk_user_id_kurejas` = '1'